reviewApp/app/controllers/application_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
	def current_user
		@current_user ||=User.find(session[ :user_id]) if session[ :user_id]

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`users_id` IS NULL LIMIT 1
---
	def checkProfile
		@profile_current ||=Profile.find_by(users_id: session[:user_id])