reviewApp/app/controllers/products_controller.rb

  def show
    @product = Product.find(params[:id])
    @reviews = Review.where(:products_id => @product.id)
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`products_Id` = 2