reviewApp/app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`category` = 'SmartPhone'
---
  def index
    @cat = params[:category]
    @products = Product.where(:category => @cat)

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1
SELECT `reviews`.* FROM `reviews` INNER JOIN `profiles` ON `profiles`.`id` = `reviews`.`profile_id` WHERE `reviews`.`products_id` = 1
---
  def show
    @product = Product.find(params[:id])
    #@reviews = Review.where(:products_id => @product.id)
    @review = Review.joins(:profile).where(:products_id => @product.id)

INSERT INTO `products` (`productName`, `brand`, `avgCost`, `category`, `releaseDate`, `description`, `prodPhoto_file_name`, `prodPhoto_content_type`, `prodPhoto_file_size`, `prodPhoto_updated_at`, `created_at`, `updated_at`) VALUES ('IPhone 10', 'Apple', 1000, 'SmartPhone', '2015-12-02', 'An expensive phone that has become a status symbol ', 'iphone.png', 'image/png', 639054, '2019-04-22 13:27:23', '2019-04-22 13:27:23', '2019-04-22 13:27:23')
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT `products`.* FROM `products` WHERE (productName LIKE '%phone')
SELECT `products`.* FROM `products`
---
  def search
    @products = if params[:term]
      Product.where('productName LIKE ?', "%#{params[:term]}")
      else
        Product.all