reviewApp/app/controllers/profiles_controller.rb

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 5 LIMIT 1
---
  def show
    @profile = Profile.find(params[:id])

INSERT INTO `profiles` (`fullName`, `dob`, `address`, `city`, `country`, `photo_file_name`, `photo_content_type`, `photo_file_size`, `photo_updated_at`, `created_at`, `updated_at`, `users_id`) VALUES ('Will', '1666-12-16', '123 Road', 'Sheffield', 'UK', 'iStock-Unfinished-Business-10.jpg', 'image/jpeg', 441452, '2019-04-18 16:06:13', '2019-04-18 16:06:13', '2019-04-18 16:06:13', 4)
---
  def create
    @profile = Profile.new(profile_params)

    if @profile.save

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 7 LIMIT 1
UPDATE `profiles` SET `photo_file_name` = 'iStock-Unfinished-Business-10.jpg', `photo_updated_at` = '2019-04-18 16:24:13', `updated_at` = '2019-04-18 16:24:13' WHERE `profiles`.`id` = 7
---
  def update
    @profile = Profile.find(params[:id])
    if @profile.update(profile_params)

SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 7 LIMIT 1
---
  def edit
    @profile = Profile.find(params[:id])