reviewApp/app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all
---
SELECT `reviews`.* FROM `reviews`

  def show
    @review = Review.find(params[:id])
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 2 LIMIT 1

  def create

    @review = Review.new(review_params)
    if @review.save
---
INSERT INTO `reviews` (`author`, `prodRating`, `reviewText`, `reviewDate`, `created_at`, `updated_at`, `profiles_id`, `products_id`) VALUES ('Will', 4, 'fgh', '2019-04-19', '2019-04-19 11:30:14', '2019-04-19 11:30:14', 1, 1)

  def edit
    @review = Review.find(params[:id])
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 21 LIMIT 1

  def update
    @review = Review.find(params[:id])
    if @review.update(review_params)
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 23 LIMIT 1
UPDATE `reviews` SET `reviewText` = 'test2', `updated_at` = '2019-04-22 10:17:37' WHERE `reviews`.`id` = 23

  def destroy
    @review = Review.find(params[:id])
    @review.destroy
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 23 LIMIT 1
DELETE FROM `reviews` WHERE `reviews`.`id` = 23