reviewApp/app/controllers/sessions_controller.rb

  def create
  	user=User.find_by_userId(params[:userId])
    profile=Profile.find_by(users_id: user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`userId` = 'willce' LIMIT 1
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`users_id` = 1 LIMIT 1