reviewApp/app/controllers/users_controller.rb

  def create
    @user=User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`userId`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('willce', 'b5020855@my.shu.ac.uk', '$2a$10$ac0LgH29Y4M0MyHr3fT2relgF0WPuDSYZOFvkyVrX8oDITEUGa/wW', '2019-04-16 13:31:28', '2019-04-16 13:31:28')

  def update
       @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 7 LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$8nOKQ9buyDyJCDh1BoqvX.RYjBGiiBhX1bUAMIXleIJ7aFgr/g9Sq', `updated_at` = '2019-04-22 10:35:20' WHERE `users`.`id` = 7